##  '########::'########::'########:'##:::::'##:'########:'####:'##:::::::'########:
##   ##.... ##: ##.... ##: ##.....:: ##:'##: ##: ##.....::. ##:: ##::::::: ##.....::
##   ##:::: ##: ##:::: ##: ##::::::: ##: ##: ##: ##:::::::: ##:: ##::::::: ##:::::::
##   ########:: ########:: ######::: ##: ##: ##: ######:::: ##:: ##::::::: ######:::
##   ##.... ##: ##.. ##::: ##...:::: ##: ##: ##: ##...::::: ##:: ##::::::: ##...::::
##   ##:::: ##: ##::. ##:: ##::::::: ##: ##: ##: ##:::::::: ##:: ##::::::: ##:::::::
##   ########:: ##:::. ##: ########:. ###. ###:: ##:::::::'####: ########: ########:
##  ........:::..:::::..::........:::...::...:::..::::::::....::........::........::
##  ################################################################################

# Homebrew Bundles
# ----------------

tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "corgibytes/cask-fonts"
tap "dracula/install"
tap "bell-sw/liberica"

# Languages
# ---------

# Python
brew "python"
# JS/TS
brew "node"
brew "pnpm"
brew "deno"
brew "typescript"
brew "typescript-language-server"
# Ruby
brew "ruby"
# Go
brew "go"
brew "gopls"
brew "gotests"
brew "gomodifytags"
brew "delve"
brew "staticcheck"
# Rust
brew "rust"
# Java
brew "java"
# Scala
brew "scala"
# Clojure
brew "clojure"
# Kotlin
brew "kotlin"
brew "xcode-kotlin"
# Swift
brew "swift"
# Lua
brew "lua"
brew "luajit"
# Elixir
brew "elixir"


# Homebrew Packages
# -----------------

# Kubernetes CLI
brew "k9s"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "eza"
# Fuzzy finder for your terminal
brew "fzf"
# git diff, but with prettier output
brew "diff-so-fancy"
# Corrects previous command
brew "thefuck"
# Docker manager
brew "lazydocker"
# Git Manager
brew "lazygit"
# a grep replacment
brew "ripgrep"
# find entries in file-system
brew "fd"
# shell history
brew "mcfly"
# Excel spreadsheet
brew "sc-im"
# Midnight Commander file explorar
brew "mc"
# command-line HTTP client
brew "curl"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement
brew "httpie"
# Pager program similar to more
brew "less"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# UNIX shell (command interpreter)
brew "zsh"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Window manager 
brew "koekeishiya/formulae/yabai"
# HotKey daemon
brew "koekeishiya/formulae/skhd"
# Minimal status bar
brew "cmacrae/formulae/spacebar"
# ASCII text art
brew "figlet"
# ASCII text art
brew "toilet"
# Shell 
brew "bash" 
# Utilities
brew "coreutils" 
# non-interactive command-line text editor
brew "gnu-sed" 
# Outputs current CPU temperature
brew "osx-cpu-temp"
# Dracula themed wallpapers
brew "dracula/install/dracula-git"
# set macOS file icons programatically
brew "fileicon"
# Push notifications for macOS
brew "ntfy"
# text editor
brew "neovim"
# protocol buffers compiler
brew "protobuf"
# JSON processor
brew "jq"

# Applications
# ------------

# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# App to build and share containerized applications and microservices
cask "docker"
# Dark theme for Alfred
cask "dracula-alfred"
# Dark theme for GitKraken
cask "dracula-gitkraken"
# Dark theme for the native Color Picker
cask "dracula-macos-color-picker"
# Dark theme for Xcode
cask "dracula-xcode"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "font-covered-by-your-grace"
# Free monospaced font with programming ligatures
cask "font-fira-code"
cask "font-hack"
# Revival of an old classic, Alternate Gothic #1
cask "font-league-gothic"
# Superfamily of fonts for code
cask "font-monaspace"
cask "font-share-tech"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Terminal built on web technologies
cask "hyper"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Java 17
cask "liberica-jdk17-full"
# password manager
cask "bitwarden"


# Fonts
# -----

cask "font-covered-by-your-grace"
cask "font-hack"
cask "font-league-gothic"
cask "font-share-tech"

# VSCode Extensions
# -----------------

vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "be5invis.toml"
vscode "be5invis.vscode-icontheme-nomo-dark"
vscode "DavidAnson.vscode-markdownlint"
vscode "dracula-theme-pro.theme-dracula-pro"
vscode "eamodio.gitlens"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "mads-hartmann.bash-ide-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "Nimda.deepdark-material"
vscode "PKief.material-icon-theme"
vscode "qinjia.seti-icons"
vscode "samuelcolvin.jinjahtml"
vscode "streetsidesoftware.code-spell-checker"
vscode "tal7aouy.icons"
vscode "teabyii.ayu"
vscode "timonwong.shellcheck"
vscode "vscode-icons-team.vscode-icons"
vscode "waifuproject.icns-preview"
