##  '########::'########::'########:'##:::::'##:'########:'####:'##:::::::'########:
##   ##.... ##: ##.... ##: ##.....:: ##:'##: ##: ##.....::. ##:: ##::::::: ##.....::
##   ##:::: ##: ##:::: ##: ##::::::: ##: ##: ##: ##:::::::: ##:: ##::::::: ##:::::::
##   ########:: ########:: ######::: ##: ##: ##: ######:::: ##:: ##::::::: ######:::
##   ##.... ##: ##.. ##::: ##...:::: ##: ##: ##: ##...::::: ##:: ##::::::: ##...::::
##   ##:::: ##: ##::. ##:: ##::::::: ##: ##: ##: ##:::::::: ##:: ##::::::: ##:::::::
##   ########:: ##:::. ##: ########:. ###. ###:: ##:::::::'####: ########: ########:
##  ........:::..:::::..::........:::...::...:::..::::::::....::........::........::
##  ################################################################################

# Homebrew Bundles
# ----------------
tap "buo/cask-upgrade"
tap "bell-sw/liberica"
tap "blacktop/tap"
tap "cmacrae/formulae"
tap "corgibytes/cask-fonts"
tap "dracula/install"
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"

# Languages
# ---------
# Python
brew "python"
brew "pyenv"
brew "uv"
# JS/TS
brew "node"
brew "pnpm"
brew "deno"
brew "typescript"
brew "typescript-language-server"
brew "vite"
# Ruby
brew "ruby"
# Go
brew "go"
brew "gopls"
brew "gotests"
brew "gomodifytags"
brew "delve"
brew "staticcheck"
# Rust
brew "rust"
# Java
brew "java"
# Scala
brew "scala"
# Clojure
brew "clojure"
# Kotlin
brew "kotlin"
brew "xcode-kotlin"
# Swift
brew "swift"
# Lua
brew "lua"
brew "luajit"
# Elixir
brew "elixir"


# Homebrew Packages
# -----------------
brew "xz"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "bash"
brew "bat"
brew "bzip2"
brew "readline"
brew "sqlite"
brew "python@3.12"
brew "harfbuzz"
brew "openjdk"
brew "clojure"
brew "coreutils"
brew "curl"
brew "delve"
brew "deno"
brew "diff-so-fancy"
brew "elixir"
brew "eza"
brew "fd"
brew "figlet"
brew "fileicon"
brew "fzf"
brew "gawk"
brew "openjpeg"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gomodifytags"
brew "gopls"
brew "gotests"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "k9s"
brew "kotlin"
brew "lazydocker"
brew "lazygit"
brew "less"
brew "luajit"
brew "mackup"
brew "mas"
brew "mcfly"
brew "midnight-commander"
brew "nano"
brew "neovim"
brew "node"
brew "ntfy"
brew "osx-cpu-temp"
brew "pnpm"
brew "protobuf"
brew "pyenv"
brew "python@3.11"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "sc-im"
brew "scala"
brew "staticcheck"
brew "swift"
brew "thefuck"
brew "toilet"
brew "typescript"
brew "typescript-language-server"
brew "uv"
brew "vim"
brew "vite"
brew "w3m"
brew "xcode-kotlin"
brew "zlib"
brew "zsh"
brew "blacktop/tap/lporg"
brew "cmacrae/formulae/spacebar"
brew "dracula/install/dracula-git"
brew "eth-p/software/bat-extras"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

# Applications
# ------------
cask "alacritty"
cask "alfred"
cask "bitwarden"
cask "brave-browser"
cask "discord"
cask "docker"
cask "dracula-alfred"
cask "dracula-gitkraken"
cask "dracula-macos-color-picker"
cask "dracula-mailspring"
cask "dracula-xcode"
cask "dropbox"
cask "gitkraken"
cask "google-chrome"
cask "hyper"
cask "insomnia"
cask "iterm2"
cask "liberica-jdk17-full"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "monitorcontrol"
cask "visual-studio-code"
cask "vlc"

# Fonts
# -----
cask "font-covered-by-your-grace"
cask "font-fira-code"
cask "font-hack"
cask "font-league-gothic"
cask "font-monaspace"
cask "font-share-tech"

# VSCode Extensions
# -----------------
vscode "alefragnani.project-manager"
vscode "almenon.arepl"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "be5invis.toml"
vscode "be5invis.vscode-icontheme-nomo-dark"
vscode "christian-kohler.npm-intellisense"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dracula-theme-pro.theme-dracula-pro"
vscode "eamodio.gitlens"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "kevinrose.vsc-python-indent"
vscode "mads-hartmann.bash-ide-vscode"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "nimda.deepdark-material"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "pkl.pkl-vscode"
vscode "qinjia.seti-icons"
vscode "samuelcolvin.jinjahtml"
vscode "streetsidesoftware.code-spell-checker"
vscode "tal7aouy.icons"
vscode "teabyii.ayu"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "timonwong.shellcheck"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "waifuproject.icns-preview"
vscode "wallabyjs.quokka-vscode"
vscode "wholroyd.jinja"
vscode "ziyasal.vscode-open-in-github"
vscode "zxh404.vscode-proto3"
