##  '########::'########::'########:'##:::::'##:'########:'####:'##:::::::'########:
##   ##.... ##: ##.... ##: ##.....:: ##:'##: ##: ##.....::. ##:: ##::::::: ##.....::
##   ##:::: ##: ##:::: ##: ##::::::: ##: ##: ##: ##:::::::: ##:: ##::::::: ##:::::::
##   ########:: ########:: ######::: ##: ##: ##: ######:::: ##:: ##::::::: ######:::
##   ##.... ##: ##.. ##::: ##...:::: ##: ##: ##: ##...::::: ##:: ##::::::: ##...::::
##   ##:::: ##: ##::. ##:: ##::::::: ##: ##: ##: ##:::::::: ##:: ##::::::: ##:::::::
##   ########:: ##:::. ##: ########:. ###. ###:: ##:::::::'####: ########: ########:
##  ........:::..:::::..::........:::...::...:::..::::::::....::........::........::
####################################################################################
# Homebrew Bundles
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "corgibytes/cask-fonts"

# Homebrew Packages
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "eza"
# Fuzzy finder for your terminal
brew "fzf"
# git diff, but with prettier output
brew "diff-so-fancy"
# Corrects previous command
brew "thefuck"
# Docker manager
brew "lazydocker"
# Git Manager
brew "lazygit"
# a grep replacment
brew "ripgrep"
# find entries in file-system
brew "fd"
# shell history
brew "mcfly"
# Excel spreadsheet
brew "sc-im"
#
brew "mc"
#  
brew "coreutils"
# 
brew "curl"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# UNIX shell (command interpreter)
brew "zsh"
#
brew "koekeishiya/formulae/yabai"
#
brew "koekeishiya/formulae/skhd"
#
brew "cmacrae/formulae/spacebar"
#
brew "figlet"
#
brew "toilet"
#
brew "gpg"
#
brew "gmp"
#
brew "gawk"
#
brew "readline"
#
brew "ncurses"
#
brew "zlib"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
#
brew "java"
#
brew "ruby"
#
brew "python"
#
brew "rust"

# Applications
cask "alfred"
cask "dropbox"
cask "gitkraken"
cask "google-chrome"
cask "hyper"
cask "iterm2"
cask "visual-studio-code"
cask "vlc"
cask "font-covered-by-your-grace"
cask "font-hack"
cask "font-league-gothic"
cask "font-share-tech"